Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute.AttributeName Property
 Gets the attribute name of the property.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AttributeName { get; }
Public ReadOnly Property AttributeName As String
	Get
Property Value
Type: String
See Also
Reference
StructuresDialogAttribute Class
Tekla.Structures.Dialog Namespace